
const posts = [
    {
        id: 1,
        title: "مقدمة في تطوير الويب الحديث",
        content: "تطوير الويب الحديث يتطلب فهم عميق لتقنيات الواجهات الأمامية والخلفية وكيفية تفاعلهما معاً.",
        image: "https://images.unsplash.com/photo-1498050108023-c5249f4df085" // مقال مع صورة
    },
    {
        id: 2,
        title: "أساسيات لغة جافا سكربت للمبتدئين",
        content: "جافا سكربت هي لغة البرمجة التي تمنح صفحات الويب الحيوية والتفاعل مع المستخدم.",
        image: null
    },
    {
        id: 3,
        title: "أهمية التصميم المتجاوب في الهواتف",
        content: "مع كثرة مستخدمي الهواتف الذكية، أصبح التصميم المتجاوب أمراً لا غنى عنه لأي موقع ناجح.",
        image: "https://images.unsplash.com/photo-1526374965328-7f61d4dc18c5"
    },
    {
        id: 4,
        title: " نصائح لتحسين أداء وقوة مواقع الويب ",
        content: "سرعة تحميل الموقع تلعب دوراً أساسياً في بقاء المستخدمين وتحسين ظهور الموقع في محركات البحث.",
        image: null
    }
];


posts.forEach(post => {
    console.log(`--- مقال رقم: ${post.id} ---`);
    console.log(`العنوان: ${post.title}`);
    console.log(`المحتوى: ${post.content}`);
    console.log(`صورة المقال: [تم العرض] -> ${post.image ?? 'default image'}`);


  

    console.log("------------------------\n");
});